import { Container, Row, Col, } from "react-bootstrap"
import "./LandingGoal.css";


const LandingGoal = () => {
    return (
        <Container className = "bg-1" fluid>
            <Row>
                <p>เริ่มการเขียนโปรแกรมกับเรา</p>
                <h5 className = "">เป้าหมายของเราคือการนำทางให้กับคุณ เพื่อทำให้การเรียนมีความเรียบง่ายขึ้น
                    หมดกับปัญหาที่ไม่รู้ว่าควรจะเริ่มต้นเรียนจากไหนด้วยการเรียนกับเรา
                </h5>
            </Row>  
<br></br>
            <Row>
                <Col className = "larnC1" xs={6} md={4}>
                    <h5><center>Learn</center></h5>
                    <p>
                        เรียนการเขียนโปรแกรมที่สอนอย่างครอบคลุม เริ่มตั้งแต่หัวข้อที่เบสิคที่สุด
                        ไปจนถึงหัวขข้อระดับสูง
                        
                        เลือกที่จะเรียนกับเรา หรือซื้คอร์สหับผู้สอนที่ทำงานร่วมกับเรา
                    </p>
                </Col>
                <Col className = "pracC2" xs={6} md={4}>
                    <h5><center>Practice</center></h5>
                    <p>
                        ฝึกทักษะการเขียนโปรแกรม ไปกับโจทย์ที่สมจริง ทั้งการทำ Quiz ท้ายบทเรียน หรือ Challenge
                        ที่ีการอัพเดทใหม่ทุกเดือน
                    </p>
                </Col>
                <Col xs={6} md={4}>
                    <h5><center>Community</center></h5>
                    <p>
                        เข้าร่วมสังคมนักเขียนโค้ดเพื่อหาเพื่อนเรียนไปด้วยกัน หรือจะเข้ามาสอบถามปัญหาเกี่ยวกับเรื่องโค้ดที่คุณมี 
                        พร้อมแลกเปลี่ยน อัพเดทข่าวสารความรู้ในวงการไปกับเราได้เลย
                    </p>
                </Col>
            </Row>
        </Container>
    )
}

export default LandingGoal
